Revit 2027 API
RebarConstraint.SetDistanceToCustomTarget Method
 Sets the distance from the RebarConstrainedHandle to the custom target.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetDistanceToCustomTarget(
	double distanceToCustomTarget
)
Public Sub SetDistanceToCustomTarget (
	distanceToCustomTarget As Double
)
public:
void SetDistanceToCustomTarget(
	double distanceToCustomTarget
)
member SetDistanceToCustomTarget :
        distanceToCustomTarget : float -> unit
Parameters
distanceToCustomTarget Double
 The distance to custom target.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The given value for distanceToCustomTarget must be no more than 30000 feet in absolute value.
InvalidOperationException |  RebarConstraint is no longer valid. -or- The RebarConstraintType of the RebarConstraint must be 'ToCustomTarget'.
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace